zephyrproject-rtos/zephyr/ext/hal/atmel/asf/sam/include/same70b/component/pwm.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PWM_SCUC_OFFSET                     (0x28)                                        /**<  (PWM_SCUC) PWM Sync Channels Update Control Register  Offset */

#define PWM_SCUC_UPDULOCK_Pos               0                                              /**< (PWM_SCUC) Synchronous Channels Update Unlock Position */
#define PWM_SCUC_UPDULOCK_Msk               (_U_(0x1) << PWM_SCUC_UPDULOCK_Pos)            /**< (PWM_SCUC) Synchronous Channels Update Unlock Mask */
#define PWM_SCUC_UPDULOCK                   PWM_SCUC_UPDULOCK_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_SCUC_UPDULOCK_Msk instead */
#define PWM_SCUC_MASK                       _U_(0x01)                                      /**< \deprecated (PWM_SCUC) Register MASK  (Use PWM_SCUC_Msk instead)  */
#define PWM_SCUC_Msk                        _U_(0x01)                                      /**< (PWM_SCUC) Register Mask  */


/* -------- PWM_SCUP : (PWM Offset: 0x2c) (R/W 32) PWM Sync Channels Update Period Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t UPR:4;                     /**< bit:   0..3  Update Period                            */
    uint32_t UPRCNT:4;                  /**< bit:   4..7  Update Period Counter                    */
    uint32_t :24;                       /**< bit:  8..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PWM_SCUP_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PWM_SCUP_OFFSET                     (0x2C)                                        /**<  (PWM_SCUP) PWM Sync Channels Update Period Register  Offset */

#define PWM_SCUP_UPR_Pos                    0                                              /**< (PWM_SCUP) Update Period Position */
#define PWM_SCUP_UPR_Msk                    (_U_(0xF) << PWM_SCUP_UPR_Pos)                 /**< (PWM_SCUP) Update Period Mask */
#define PWM_SCUP_UPR(value)                 (PWM_SCUP_UPR_Msk & ((value) << PWM_SCUP_UPR_Pos))
#define PWM_SCUP_UPRCNT_Pos                 4                                              /**< (PWM_SCUP) Update Period Counter Position */
#define PWM_SCUP_UPRCNT_Msk                 (_U_(0xF) << PWM_SCUP_UPRCNT_Pos)              /**< (PWM_SCUP) Update Period Counter Mask */
#define PWM_SCUP_UPRCNT(value)              (PWM_SCUP_UPRCNT_Msk & ((value) << PWM_SCUP_UPRCNT_Pos))
#define PWM_SCUP_MASK                       _U_(0xFF)                                      /**< \deprecated (PWM_SCUP) Register MASK  (Use PWM_SCUP_Msk instead)  */
#define PWM_SCUP_Msk                        _U_(0xFF)                                      /**< (PWM_SCUP) Register Mask  */


/* -------- PWM_SCUPUPD : (PWM Offset: 0x30) (/W 32) PWM Sync Channels Update Period Update Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t UPRUPD:4;                  /**< bit:   0..3  Update Period Update                     */
    uint32_t :28;                       /**< bit:  4..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PWM_SCUPUPD_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PWM_SCUPUPD_OFFSET                  (0x30)                                        /**<  (PWM_SCUPUPD) PWM Sync Channels Update Period Update Register  Offset */

#define PWM_SCUPUPD_UPRUPD_Pos              0                                              /**< (PWM_SCUPUPD) Update Period Update Position */
#define PWM_SCUPUPD_UPRUPD_Msk              (_U_(0xF) << PWM_SCUPUPD_UPRUPD_Pos)           /**< (PWM_SCUPUPD) Update Period Update Mask */
#define PWM_SCUPUPD_UPRUPD(value)           (PWM_SCUPUPD_UPRUPD_Msk & ((value) << PWM_SCUPUPD_UPRUPD_Pos))
#define PWM_SCUPUPD_MASK                    _U_(0x0F)                                      /**< \deprecated (PWM_SCUPUPD) Register MASK  (Use PWM_SCUPUPD_Msk instead)  */
#define PWM_SCUPUPD_Msk                     _U_(0x0F)                                      /**< (PWM_SCUPUPD) Register Mask  */


/* -------- PWM_IER2 : (PWM Offset: 0x34) (/W 32) PWM Interrupt Enable Register 2 -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t WRDY:1;                    /**< bit:      0  Write Ready for Synchronous Channels Update Interrupt Enable */
    uint32_t :2;                        /**< bit:   1..2  Reserved */
    uint32_t UNRE:1;                    /**< bit:      3  Synchronous Channels Update Underrun Error Interrupt Enable */
    uint32_t :4;                        /**< bit:   4..7  Reserved */
    uint32_t CMPM0:1;                   /**< bit:      8  Comparison 0 Match Interrupt Enable      */
    uint32_t CMPM1:1;                   /**< bit:      9  Comparison 1 Match Interrupt Enable      */
    uint32_t CMPM2:1;                   /**< bit:     10  Comparison 2 Match Interrupt Enable      */
    uint32_t CMPM3:1;                   /**< bit:     11  Comparison 3 Match Interrupt Enable      */
    uint32_t CMPM4:1;                   /**< bit:     12  Comparison 4 Match Interrupt Enable      */
    uint32_t CMPM5:1;                   /**< bit:     13  Comparison 5 Match Interrupt Enable      */
    uint32_t CMPM6:1;                   /**< bit:     14  Comparison 6 Match Interrupt Enable      */
    uint32_t CMPM7:1;                   /**< bit:     15  Comparison 7 Match Interrupt Enable      */
    uint32_t CMPU0:1;                   /**< bit:     16  Comparison 0 Update Interrupt Enable     */
    uint32_t CMPU1:1;                   /**< bit:     17  Comparison 1 Update Interrupt Enable     */
    uint32_t CMPU2:1;                   /**< bit:     18  Comparison 2 Update Interrupt Enable     */
    uint32_t CMPU3:1;                   /**< bit:     19  Comparison 3 Update Interrupt Enable     */
    uint32_t CMPU4:1;                   /**< bit:     20  Comparison 4 Update Interrupt Enable     */
    uint32_t CMPU5:1;                   /**< bit:     21  Comparison 5 Update Interrupt Enable     */
    uint32_t CMPU6:1;                   /**< bit:     22  Comparison 6 Update Interrupt Enable     */
    uint32_t CMPU7:1;                   /**< bit:     23  Comparison 7 Update Interrupt Enable     */
    uint32_t :8;                        /**< bit: 24..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t :8;                        /**< bit:   0..7  Reserved */
    uint32_t CMPM:8;                    /**< bit:  8..15  Comparison x Match Interrupt Enable      */
    uint32_t CMPU:8;                    /**< bit: 16..23  Comparison 7 Update Interrupt Enable     */
    uint32_t :8;                        /**< bit: 24..31 Reserved */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} PWM_IER2_Type;
