zephyrproject-rtos/zephyr/ext/hal/atmel/asf/sam/include/same70b/component/pwm.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PWM_FPV1_OFFSET                     (0x68)                                        /**<  (PWM_FPV1) PWM Fault Protection Value Register 1  Offset */

#define PWM_FPV1_FPVH0_Pos                  0                                              /**< (PWM_FPV1) Fault Protection Value for PWMH output on channel 0 Position */
#define PWM_FPV1_FPVH0_Msk                  (_U_(0x1) << PWM_FPV1_FPVH0_Pos)               /**< (PWM_FPV1) Fault Protection Value for PWMH output on channel 0 Mask */
#define PWM_FPV1_FPVH0                      PWM_FPV1_FPVH0_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_FPV1_FPVH0_Msk instead */
#define PWM_FPV1_FPVH1_Pos                  1                                              /**< (PWM_FPV1) Fault Protection Value for PWMH output on channel 1 Position */
#define PWM_FPV1_FPVH1_Msk                  (_U_(0x1) << PWM_FPV1_FPVH1_Pos)               /**< (PWM_FPV1) Fault Protection Value for PWMH output on channel 1 Mask */
#define PWM_FPV1_FPVH1                      PWM_FPV1_FPVH1_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_FPV1_FPVH1_Msk instead */
#define PWM_FPV1_FPVH2_Pos                  2                                              /**< (PWM_FPV1) Fault Protection Value for PWMH output on channel 2 Position */
#define PWM_FPV1_FPVH2_Msk                  (_U_(0x1) << PWM_FPV1_FPVH2_Pos)               /**< (PWM_FPV1) Fault Protection Value for PWMH output on channel 2 Mask */
#define PWM_FPV1_FPVH2                      PWM_FPV1_FPVH2_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_FPV1_FPVH2_Msk instead */
#define PWM_FPV1_FPVH3_Pos                  3                                              /**< (PWM_FPV1) Fault Protection Value for PWMH output on channel 3 Position */
#define PWM_FPV1_FPVH3_Msk                  (_U_(0x1) << PWM_FPV1_FPVH3_Pos)               /**< (PWM_FPV1) Fault Protection Value for PWMH output on channel 3 Mask */
#define PWM_FPV1_FPVH3                      PWM_FPV1_FPVH3_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_FPV1_FPVH3_Msk instead */
#define PWM_FPV1_FPVL0_Pos                  16                                             /**< (PWM_FPV1) Fault Protection Value for PWML output on channel 0 Position */
#define PWM_FPV1_FPVL0_Msk                  (_U_(0x1) << PWM_FPV1_FPVL0_Pos)               /**< (PWM_FPV1) Fault Protection Value for PWML output on channel 0 Mask */
#define PWM_FPV1_FPVL0                      PWM_FPV1_FPVL0_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_FPV1_FPVL0_Msk instead */
#define PWM_FPV1_FPVL1_Pos                  17                                             /**< (PWM_FPV1) Fault Protection Value for PWML output on channel 1 Position */
#define PWM_FPV1_FPVL1_Msk                  (_U_(0x1) << PWM_FPV1_FPVL1_Pos)               /**< (PWM_FPV1) Fault Protection Value for PWML output on channel 1 Mask */
#define PWM_FPV1_FPVL1                      PWM_FPV1_FPVL1_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_FPV1_FPVL1_Msk instead */
#define PWM_FPV1_FPVL2_Pos                  18                                             /**< (PWM_FPV1) Fault Protection Value for PWML output on channel 2 Position */
#define PWM_FPV1_FPVL2_Msk                  (_U_(0x1) << PWM_FPV1_FPVL2_Pos)               /**< (PWM_FPV1) Fault Protection Value for PWML output on channel 2 Mask */
#define PWM_FPV1_FPVL2                      PWM_FPV1_FPVL2_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_FPV1_FPVL2_Msk instead */
#define PWM_FPV1_FPVL3_Pos                  19                                             /**< (PWM_FPV1) Fault Protection Value for PWML output on channel 3 Position */
#define PWM_FPV1_FPVL3_Msk                  (_U_(0x1) << PWM_FPV1_FPVL3_Pos)               /**< (PWM_FPV1) Fault Protection Value for PWML output on channel 3 Mask */
#define PWM_FPV1_FPVL3                      PWM_FPV1_FPVL3_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_FPV1_FPVL3_Msk instead */
#define PWM_FPV1_MASK                       _U_(0xF000F)                                   /**< \deprecated (PWM_FPV1) Register MASK  (Use PWM_FPV1_Msk instead)  */
#define PWM_FPV1_Msk                        _U_(0xF000F)                                   /**< (PWM_FPV1) Register Mask  */

#define PWM_FPV1_FPVH_Pos                   0                                              /**< (PWM_FPV1 Position) Fault Protection Value for PWMH output on channel x */
#define PWM_FPV1_FPVH_Msk                   (_U_(0xF) << PWM_FPV1_FPVH_Pos)                /**< (PWM_FPV1 Mask) FPVH */
#define PWM_FPV1_FPVH(value)                (PWM_FPV1_FPVH_Msk & ((value) << PWM_FPV1_FPVH_Pos))  
#define PWM_FPV1_FPVL_Pos                   16                                             /**< (PWM_FPV1 Position) Fault Protection Value for PWML output on channel 3 */
#define PWM_FPV1_FPVL_Msk                   (_U_(0xF) << PWM_FPV1_FPVL_Pos)                /**< (PWM_FPV1 Mask) FPVL */
#define PWM_FPV1_FPVL(value)                (PWM_FPV1_FPVL_Msk & ((value) << PWM_FPV1_FPVL_Pos))  

/* -------- PWM_FPE : (PWM Offset: 0x6c) (R/W 32) PWM Fault Protection Enable Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t FPE0:8;                    /**< bit:   0..7  Fault Protection Enable for channel 0    */
    uint32_t FPE1:8;                    /**< bit:  8..15  Fault Protection Enable for channel 1    */
    uint32_t FPE2:8;                    /**< bit: 16..23  Fault Protection Enable for channel 2    */
    uint32_t FPE3:8;                    /**< bit: 24..31  Fault Protection Enable for channel 3    */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PWM_FPE_Type;
