zephyrproject-rtos/zephyr/ext/hal/atmel/asf/sam/include/same70b/component/pwm.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PWM_FPE_OFFSET                      (0x6C)                                        /**<  (PWM_FPE) PWM Fault Protection Enable Register  Offset */

#define PWM_FPE_FPE0_Pos                    0                                              /**< (PWM_FPE) Fault Protection Enable for channel 0 Position */
#define PWM_FPE_FPE0_Msk                    (_U_(0xFF) << PWM_FPE_FPE0_Pos)                /**< (PWM_FPE) Fault Protection Enable for channel 0 Mask */
#define PWM_FPE_FPE0(value)                 (PWM_FPE_FPE0_Msk & ((value) << PWM_FPE_FPE0_Pos))
#define PWM_FPE_FPE1_Pos                    8                                              /**< (PWM_FPE) Fault Protection Enable for channel 1 Position */
#define PWM_FPE_FPE1_Msk                    (_U_(0xFF) << PWM_FPE_FPE1_Pos)                /**< (PWM_FPE) Fault Protection Enable for channel 1 Mask */
#define PWM_FPE_FPE1(value)                 (PWM_FPE_FPE1_Msk & ((value) << PWM_FPE_FPE1_Pos))
#define PWM_FPE_FPE2_Pos                    16                                             /**< (PWM_FPE) Fault Protection Enable for channel 2 Position */
#define PWM_FPE_FPE2_Msk                    (_U_(0xFF) << PWM_FPE_FPE2_Pos)                /**< (PWM_FPE) Fault Protection Enable for channel 2 Mask */
#define PWM_FPE_FPE2(value)                 (PWM_FPE_FPE2_Msk & ((value) << PWM_FPE_FPE2_Pos))
#define PWM_FPE_FPE3_Pos                    24                                             /**< (PWM_FPE) Fault Protection Enable for channel 3 Position */
#define PWM_FPE_FPE3_Msk                    (_U_(0xFF) << PWM_FPE_FPE3_Pos)                /**< (PWM_FPE) Fault Protection Enable for channel 3 Mask */
#define PWM_FPE_FPE3(value)                 (PWM_FPE_FPE3_Msk & ((value) << PWM_FPE_FPE3_Pos))
#define PWM_FPE_MASK                        _U_(0xFFFFFFFF)                                /**< \deprecated (PWM_FPE) Register MASK  (Use PWM_FPE_Msk instead)  */
#define PWM_FPE_Msk                         _U_(0xFFFFFFFF)                                /**< (PWM_FPE) Register Mask  */


/* -------- PWM_ELMR : (PWM Offset: 0x7c) (R/W 32) PWM Event Line 0 Mode Register 0 -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t CSEL0:1;                   /**< bit:      0  Comparison 0 Selection                   */
    uint32_t CSEL1:1;                   /**< bit:      1  Comparison 1 Selection                   */
    uint32_t CSEL2:1;                   /**< bit:      2  Comparison 2 Selection                   */
    uint32_t CSEL3:1;                   /**< bit:      3  Comparison 3 Selection                   */
    uint32_t CSEL4:1;                   /**< bit:      4  Comparison 4 Selection                   */
    uint32_t CSEL5:1;                   /**< bit:      5  Comparison 5 Selection                   */
    uint32_t CSEL6:1;                   /**< bit:      6  Comparison 6 Selection                   */
    uint32_t CSEL7:1;                   /**< bit:      7  Comparison 7 Selection                   */
    uint32_t :24;                       /**< bit:  8..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t CSEL:8;                    /**< bit:   0..7  Comparison 7 Selection                   */
    uint32_t :24;                       /**< bit:  8..31 Reserved */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} PWM_ELMR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PWM_ELMR_OFFSET                     (0x7C)                                        /**<  (PWM_ELMR) PWM Event Line 0 Mode Register 0  Offset */

#define PWM_ELMR_CSEL0_Pos                  0                                              /**< (PWM_ELMR) Comparison 0 Selection Position */
#define PWM_ELMR_CSEL0_Msk                  (_U_(0x1) << PWM_ELMR_CSEL0_Pos)               /**< (PWM_ELMR) Comparison 0 Selection Mask */
#define PWM_ELMR_CSEL0                      PWM_ELMR_CSEL0_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_ELMR_CSEL0_Msk instead */
#define PWM_ELMR_CSEL1_Pos                  1                                              /**< (PWM_ELMR) Comparison 1 Selection Position */
#define PWM_ELMR_CSEL1_Msk                  (_U_(0x1) << PWM_ELMR_CSEL1_Pos)               /**< (PWM_ELMR) Comparison 1 Selection Mask */
#define PWM_ELMR_CSEL1                      PWM_ELMR_CSEL1_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_ELMR_CSEL1_Msk instead */
#define PWM_ELMR_CSEL2_Pos                  2                                              /**< (PWM_ELMR) Comparison 2 Selection Position */
#define PWM_ELMR_CSEL2_Msk                  (_U_(0x1) << PWM_ELMR_CSEL2_Pos)               /**< (PWM_ELMR) Comparison 2 Selection Mask */
#define PWM_ELMR_CSEL2                      PWM_ELMR_CSEL2_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_ELMR_CSEL2_Msk instead */
#define PWM_ELMR_CSEL3_Pos                  3                                              /**< (PWM_ELMR) Comparison 3 Selection Position */
#define PWM_ELMR_CSEL3_Msk                  (_U_(0x1) << PWM_ELMR_CSEL3_Pos)               /**< (PWM_ELMR) Comparison 3 Selection Mask */
#define PWM_ELMR_CSEL3                      PWM_ELMR_CSEL3_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_ELMR_CSEL3_Msk instead */
#define PWM_ELMR_CSEL4_Pos                  4                                              /**< (PWM_ELMR) Comparison 4 Selection Position */
#define PWM_ELMR_CSEL4_Msk                  (_U_(0x1) << PWM_ELMR_CSEL4_Pos)               /**< (PWM_ELMR) Comparison 4 Selection Mask */
#define PWM_ELMR_CSEL4                      PWM_ELMR_CSEL4_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_ELMR_CSEL4_Msk instead */
#define PWM_ELMR_CSEL5_Pos                  5                                              /**< (PWM_ELMR) Comparison 5 Selection Position */
#define PWM_ELMR_CSEL5_Msk                  (_U_(0x1) << PWM_ELMR_CSEL5_Pos)               /**< (PWM_ELMR) Comparison 5 Selection Mask */
#define PWM_ELMR_CSEL5                      PWM_ELMR_CSEL5_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_ELMR_CSEL5_Msk instead */
#define PWM_ELMR_CSEL6_Pos                  6                                              /**< (PWM_ELMR) Comparison 6 Selection Position */
#define PWM_ELMR_CSEL6_Msk                  (_U_(0x1) << PWM_ELMR_CSEL6_Pos)               /**< (PWM_ELMR) Comparison 6 Selection Mask */
#define PWM_ELMR_CSEL6                      PWM_ELMR_CSEL6_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_ELMR_CSEL6_Msk instead */
#define PWM_ELMR_CSEL7_Pos                  7                                              /**< (PWM_ELMR) Comparison 7 Selection Position */
#define PWM_ELMR_CSEL7_Msk                  (_U_(0x1) << PWM_ELMR_CSEL7_Pos)               /**< (PWM_ELMR) Comparison 7 Selection Mask */
#define PWM_ELMR_CSEL7                      PWM_ELMR_CSEL7_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_ELMR_CSEL7_Msk instead */
#define PWM_ELMR_MASK                       _U_(0xFF)                                      /**< \deprecated (PWM_ELMR) Register MASK  (Use PWM_ELMR_Msk instead)  */
#define PWM_ELMR_Msk                        _U_(0xFF)                                      /**< (PWM_ELMR) Register Mask  */

#define PWM_ELMR_CSEL_Pos                   0                                              /**< (PWM_ELMR Position) Comparison 7 Selection */
#define PWM_ELMR_CSEL_Msk                   (_U_(0xFF) << PWM_ELMR_CSEL_Pos)               /**< (PWM_ELMR Mask) CSEL */
#define PWM_ELMR_CSEL(value)                (PWM_ELMR_CSEL_Msk & ((value) << PWM_ELMR_CSEL_Pos))  

